tutorials/basic/simpleFoam/3D/Calcarb/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile {
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField {
  x_min
  {
    type            zeroGradient;
  }
  x_max
  {
    type            fixedValue;
    value           uniform 0;
  }
  wall
  {
    type            zeroGradient;
  }
  y_min
  {
    type            zeroGradient;
  }
  y_max
  {
    type            zeroGradient;
  }
  z_min
  {
    type            zeroGradient;
  }
  z_max
  {
    type            zeroGradient;
  }
  fibres
  {
    type            zeroGradient;
  }
}


// ************************************************************************* //
