tutorials/basic/simpleFoam/3D/Calcarb/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile {
  version     2.0;
  format      ascii;
  class       dictionary;
  object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
( {
  action  new;
  name    effectiveDomainCellSet;
  type    cellSet;

  source boxToCell;

  sourceInfo
  {
    box (100e-6 0 0) (300e-6 200e-6 200e-6);
  }

}

{
  action  new;
  name    effectiveDomain;
  type    cellZoneSet;

  source setToCellZone;

  sourceInfo
  {
    set effectiveDomainCellSet;
  }
}
);


// ************************************************************************* //
